exports.fantasyLanguageMaps = {
	'Dwarven': {
		consonants: ['m', 'p', 'b', 'n', 't', 'd', 's', 'z', 'k', 'ɡ', 'ɳ', 'ʑ', 'f', 'v', 'ð', 'r', 'ʜ', 'ʙ', 'h', 'ʎ', 'ʟ̠'],
		vowels: ['i', 'o', 'e', 'æ', 'ə', 'ʌ', 'u']
	}, 
	'Mermaid': {
		consonants: ['m', 'n', 'ŋ', 'p', 'b', 't', 'd', 'k', 'ɡ', 't̠ʃ', 'd̠ʒ', 'f', 'v', 'θ', 'ð', 's', 'z', 'ʃ', 'ʒ', 'h', 'l', 'ɹ', 'j', 'ɰ'],
		vowels: ['i','iː','ɪ','e', 'ɛ', 'æ', 'ɑː', 'ɑ', 'ɒ', 'ɔ', 'ɑ', 'ɔː', 'uː', 'u', 'ʊ', 'ʌ', 'ɜː', 'ɜɹ', 'ə',],
	}, 
	'Elven-Common': {
		consonants: ['m', 'n', 'ŋ', 'p', 'b', 't', 'd', 'k', 'ɡ', 't̠ʃ', 'd̠ʒ', 'f', 'v', 'θ', 'ð', 's', 'z', 'ʃ', 'ʒ', 'h', 'l', 'ɹ', 'j', 'ɰ'],
		vowels: ['i','iː','ɪ','e', 'ɛ', 'æ', 'ɑː', 'ɑ', 'ɒ', 'ɔ', 'ɑ', 'ɔː', 'uː', 'u', 'ʊ', 'ʌ', 'ɜː', 'ɜɹ', 'ə',],
	}, 
	'Elven-Deep': {
		consonants: ['m', 'n', 'ŋ', 'p', 'b', 't', 'd', 'k', 'ɡ', 't̠ʃ', 'd̠ʒ', 'f', 'v', 'θ', 'ð', 's', 'z', 'ʃ', 'ʒ', 'h', 'l', 'ɹ', 'j', 'ɰ'],
		vowels: ['i','iː','ɪ','e', 'ɛ', 'æ', 'ɑː', 'ɑ', 'ɒ', 'ɔ', 'ɑ', 'ɔː', 'uː', 'u', 'ʊ', 'ʌ', 'ɜː', 'ɜɹ', 'ə',],
	}, 
	'Dragon': {
		consonants: ['m', 'n', 'ŋ', 'p', 'b', 't', 'd', 'k', 'ɡ', 't̠ʃ', 'd̠ʒ', 'f', 'v', 'θ', 'ð', 's', 'z', 'ʃ', 'ʒ', 'h', 'l', 'ɹ', 'j', 'ɰ'],
		vowels: ['i','iː','ɪ','e', 'ɛ', 'æ', 'ɑː', 'ɑ', 'ɒ', 'ɔ', 'ɑ', 'ɔː', 'uː', 'u', 'ʊ', 'ʌ', 'ɜː', 'ɜɹ', 'ə',],
	}, 
}
exports.fantasyLanguageWritten = {
	'm':'m', 
	'p':'p', 
	'b':'b', 
	'n':'n', 
	't':'t', 
	'd':'d', 
	's':'s', 
	'z':'z', 
	'k':'k', 
	'ɡ':'g', 
	'ɳ':'n', 
	'ʑ':'z', 
	'f':'f', 
	'v':'v', 
	'ð':'l', 
	'r':'r', 
	'ʜ':'h', 
	'ʙ':'b', 
	'h':'h', 
	'ʎ':'y', 
	'ʟ̠':'l',
	'i':'i', 
	'o':'o', 
	'e':'e', 
	'æ':'a', 
	'ə':'a', 
	'ʌ':'o', 
	'u':'o',
}